w8d1/reddit_clone/reddit_clone/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "Zm510Pc8i6w4fRf51UtUNQ"], ["updated_at", "2021-03-08 22:00:32.690538"], ["id", 1]]
---
  def reset_session_token!
    self.session_token = SecureRandom.urlsafe_base64
    self.save!

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "3crypt"], ["LIMIT", 1]]
---
  def self.find_by_credentials(username, password)
    user = User.find_by(username: username)