w8d1/reddit_clone/reddit_clone/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @user = User.find_by(id: params[:id])

INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @user = User.find_by(id: params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "3rypt"], ["password_digest", "$2a$12$W6NA2xe9hjSJWrcf4Tl5T.d0y3EAoTgnzFSVTYhWag0l0GlOLDgte"], ["updated_at", "2021-03-08 22:03:58.190494"], ["id", 1]]
---
  def update
    @user = User.find_by(id: params[:id])
    if @user && @user.id == current_user.id
      if @user.update(user_params)